app/Controllers/Blog.php

    public function delete($id)
    {
        $this->blogModel->delete($id);
---
DELETE FROM `blog`
WHERE `id` IN ('25')

    public function edit($slug)
    {
        $data = [
            'title' => 'form Ubah Data Blog',
            'validation' => session('validation') ?? \Config\Services::validation(),
            'blog' => $this->blogModel->asArray()->where('slug', $slug)->first()
---
SELECT *
FROM `blog`
WHERE `slug` = 'mendesign-dengan-mudahhh'
 LIMIT 1

    public function update($id)
    {

        $slug = url_title($this->request->getVar('judul'), '-', true);
        $this->blogModel->save([
            'id' => $id,
            'judul' => $this-> request->getVar('judul'),
            'slug' => $slug,
            'gambar' => $this->request->getVar('gambar'),
            'deskripsi' =>$this->request->getVar('deskripsi'),
        ]);
---
UPDATE `blog` SET `judul` = 'mendesign dengan mudah dan benarrr', `slug` = 'mendesign-dengan-mudah-dan-benarrr', `gambar` = '1745625640_21e36d8cfc5d5b4d3405.png', `deskripsi` = 'sampelll isi bloggggg baruuuu', `updated_at` = '2025-04-26 00:05:27'
WHERE `blog`.`id` IN ('25')