app/Models/BlogModel.php

SELECT *
FROM `blog`
SELECT *
FROM `blog`
WHERE `slug` = '5-tips-mendesain-ui-yang-efektif'
 LIMIT 1
---
    public function getBlog($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
        }

        return $this->where(['slug' => $slug])->first();